"""У книзі на одній сторінці поміщається k рядків. Таким чином, на 1-й сторінці
друкуються рядки з 1-го по k-й, на другій сторінці - з (k + 1)-й по (2 * k)-й
і т. д. Напишіть програму, на вхід якої подається кількість рядків k на сторінці
і номер рядка n в тексті, по якому визначається номер сторінки, на якій буде
надрукований цей рядок, і порядковий номер цього рядка на сторінці.
Голомоза Інна Андріївна"""

# Введення даних
k = int(input("Введіть кількість рядків на сторінці: "))
n = int(input("Введіть номер рядка в тексті: "))

# Обчислення та виведення результату
page = (n - 1) // k + 1
line = (n - 1) % k + 1


print("Рядок", n, "знаходиться на сторінці", page, "на місці", line)

